netify-soap/src/test/resources/soap/requests/movie/AddMovieRequestTest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:gen="http://duo.nl/namespace/netify/general"
                  xmlns:mov="http://duo.nl/namespace/netify/datatypes/movie" xmlns:gen1="http://duo.nl/namespace/netify/datatypes/genre"
                  xmlns:role="http://duo.nl/namespace/netify/datatypes/role" xmlns:act="http://duo.nl/namespace/netify/datatypes/actor">
    <soapenv:Header/>
    <soapenv:Body>
        <gen:AddMovieRequest>
            <gen:movie>
                <mov:imdbId>t74578</mov:imdbId>
                <mov:title>Star Wars I</mov:title>
                <mov:originalTitle>Star Wars the beginning</mov:originalTitle>
                <mov:releaseDate>1958-05-05</mov:releaseDate>
                <mov:runtime>189</mov:runtime>
                <mov:originalLanguage>en</mov:originalLanguage>
                <mov:popularity>3.5468</mov:popularity>
                <mov:homepage>http://google.com</mov:homepage>
                <mov:budget>1500000</mov:budget>
                <mov:revenue>1</mov:revenue>
                <mov:status>released</mov:status>
                <mov:tagline>A true story</mov:tagline>
                <mov:overview>Luck blabla</mov:overview>
                <mov:genres>
                    <gen1:genre>
                        <gen1:name>Drama</gen1:name>
                    </gen1:genre>
                </mov:genres>
                <mov:cast>
                    <role:role>
                        <role:character>Yolo</role:character>
                        <role:order>1</role:order>
                        <role:actor>
                            <act:name>Chris Brown</act:name>
                            <act:gender>MALE</act:gender>
                        </role:actor>
                    </role:role>
                </mov:cast>
            </gen:movie>
        </gen:AddMovieRequest>
    </soapenv:Body>
</soapenv:Envelope>